app/controllers/foods_controller.rb

  def index
    @foods = Food.all
---
SELECT `foods`.* FROM `foods`

  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save
---
INSERT INTO `foods` (`name`, `description`, `properties`, `created_at`, `updated_at`) VALUES ('Zanahoria', 'Vegetal naranja de forma alargada.', 'Rico en betacaroteno, bueno para la vista', '2015-12-04 14:26:41', '2015-12-04 14:26:41')

  def update
    respond_to do |format|
      if @food.update(food_params)
---
UPDATE `foods` SET `description` = 'Tubérculo ancestral', `updated_at` = '2015-12-04 14:04:54' WHERE `foods`.`id` = 1

  def destroy
    @food.destroy
---
DELETE FROM `foods` WHERE `foods`.`id` = 1

    def set_food
      @food = Food.find(params[:id])
---
SELECT  `foods`.* FROM `foods` WHERE `foods`.`id` = 1 LIMIT 1

    def set_properties
      # Useful symbols to work with the queries in this method
      :Vitamina
      :Proteína
      :Carbohidrato
      :Mineral
      :Grasa
      @components_ids_marked = []

      @components_marked = Hash.new
      @components_all = Hash.new

      # Store all components within a has named after the ComponentType.name
      ComponentType.all.each do |component_type|
        @components_all[component_type.name] = Component.where(component_types_id: component_type.id)
      end

      if params[:id]
        # Fetching the component_id values for every Food matching the :id given
        # within the "params" hash.
        FoodsDatum.where(foods_id: params[:id]).each do |foods_datum|
          #TODO
          @components_marked[
            Component.find(id: foods_datum.components_id).component_types_id
            ] foods_datum.components_id
---
SELECT `component_types`.* FROM `component_types`
SELECT `components`.* FROM `components` WHERE `components`.`component_types_id` = 1
SELECT  `component_types`.* FROM `component_types` WHERE `component_types`.`id` = 1 LIMIT 1
SELECT  `components`.* FROM `components` WHERE `components`.`id` = NULL LIMIT 1